app/Models/Home_model.php

    public function check_conn()
    {
        $db = \Config\Database::connect('db2');
        $tb = $db->table("master_user");
        $get = $tb->get();
---
SELECT *
FROM `master_user`